Documents/ОтчетКомитентуОПродажах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ОтчетКомитентуОПродажах</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийОтчетКомитентуОПродажах</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СтавкаНДСВознаграждения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЭТ_ДоговорТО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаНДСВознаграждения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаВознаграждения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоМест</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Покупатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДатаРеализации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДокументРасчетов</Name>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ОтчетКомитентуОПродажах/Ext/ManagerModule.bsl
Функция ПечатьОтчетАгента(МассивОбъектов, ОбъектыПечати)
    
    УстановитьПривилегированныйРежим(Истина);
    
    ТабличныйДокумент = Новый ТабличныйДокумент;
    ТабличныйДокумент.АвтоМасштаб = Истина;
    ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
    ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ОтчетКомитентуОПродажах_ЭТ_ОтчетАгента";
    
    ДополнительнаяКолонкаПечатныхФормДокументов = Константы.ДополнительнаяКолонкаПечатныхФормДокументов.Получить();
    Если НЕ ЗначениеЗаполнено(ДополнительнаяКолонкаПечатныхФормДокументов) Тогда
        ДополнительнаяКолонкаПечатныхФормДокументов = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.НеВыводить;
    КонецЕсли;
    
    // *** Загружаем макет ОДИН РАЗ в начале ***
    Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ОтчетКомитентуОПродажах.ЭТ_ОтчетАгента");
    
    Запрос = Новый Запрос();
    Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
    Запрос.УстановитьПараметр("ДополнительнаяКолонкаПечатныхФормДокументов", ДополнительнаяКолонкаПечатныхФормДокументов);
    
    // Запрос БЕЗ ИТОГОВ (тот же что был в предыдущем ответе)
    Запрос.Текст =
    "ВЫБРАТЬ
    |	ОтчетКомитентуОПродажах.Ссылка КАК Ссылка,
    |	ОтчетКомитентуОПродажах.Ссылка.ВидОперации КАК ВидОперации,
    |	ОтчетКомитентуОПродажах.Ссылка.Номер КАК Номер,
    |	ОтчетКомитентуОПродажах.Ссылка.Дата КАК Дата,
    |	ОтчетКомитентуОПродажах.Ссылка.ДоговорКонтрагента КАК ДоговорКонтрагента,
    |	ОтчетКомитентуОПродажах.Ссылка.Контрагент КАК Контрагент,
    |	ОтчетКомитентуОПродажах.Ссылка.Организация КАК Организация,
    |	ОтчетКомитентуОПродажах.Ссылка.СуммаДокумента КАК СуммаДокумента,
    |	ОтчетКомитентуОПродажах.Ссылка.ВалютаДокумента КАК ВалютаДокумента,
    |	ОтчетКомитентуОПродажах.Ссылка.СтавкаНДСВознаграждения КАК СтавкаНДСВознаграждения,
    |	ОтчетКомитентуОПродажах.Ссылка.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
    |	ОтчетКомитентуОПродажах.НомерСтроки КАК НомерСтроки,
    |	ОтчетКомитентуОПродажах.Номенклатура КАК ТоварНаименование,
    |	ОтчетКомитентуОПродажах.Содержание КАК ТоварСодержание,
    |	ОтчетКомитентуОПродажах.КоличествоМест КАК КоличествоМест,
    |	ОтчетКомитентуОПродажах.ЕдиницаИзмерения.Представление КАК ЕдиницаИзмерения,
    |	ОтчетКомитентуОПродажах.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаХранения,
    |	ОтчетКомитентуОПродажах.Количество КАК Количество,
    |	ОтчетКомитентуОПродажах.Цена КАК Цена,
    |	ОтчетКомитентуОПродажах.Сумма КАК Сумма,
    |	ОтчетКомитентуОПродажах.СуммаНДС КАК СуммаНДС,
    |	ОтчетКомитентуОПродажах.Покупатель КАК ПокупательПоставщик,
    |	ОтчетКомитентуОПродажах.ДатаРеализации КАК ДатаПродажи,
    |	ОтчетКомитентуОПродажах.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
    |	ОтчетКомитентуОПродажах.Покупатель КАК ПолеДляИтогов,
    |	ОтчетКомитентуОПродажах.ДокументРасчетов КАК ДокументРасчетов,
    |	ОтчетКомитентуОПродажах.СуммаВознаграждения КАК СуммаВознаграждения,
    |	ОтчетКомитентуОПродажах.СуммаНДСВознаграждения КАК СуммаНДСВознаграждения
    |ИЗ
    |	Документ.ОтчетКомитентуОПродажах.Товары КАК ОтчетКомитентуОПродажах
    |ГДЕ
    |	ОтчетКомитентуОПродажах.Ссылка В(&МассивОбъектов)
    |	И ОтчетКомитентуОПродажах.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОтчетКомитентуОПродажах.ОтчетОПродажах)
    |
    |УПОРЯДОЧИТЬ ПО
    |	Ссылка,
    |	Дата,
    |	ПолеДляИтогов,
    |	НомерСтроки";
	
    ВыборкаВсехСтрок = Запрос.Выполнить().Выбрать();
    
    ПервыйДокумент = Истина;
    ТекущийДокумент = Неопределено;
    ТекущийИтого = 0;
    ТекущийИтогоВознаграждения = 0;
    НомерПП = 1;
    КоличествоТоваров = 0;
    НомерСтрокиНачало = 0;
	СуммаНДСВознаграждения = 0;
    
    Пока ВыборкаВсехСтрок.Следующий() Цикл
        
        Если ТекущийДокумент <> ВыборкаВсехСтрок.Ссылка Тогда
            
            // Завершаем предыдущий документ
            Если ТекущийДокумент <> Неопределено Тогда
                ВывестиИтогиДокумента(ТабличныйДокумент, Макет, ТекущийДокумент, ТекущийИтого, ТекущийИтогоВознаграждения, КоличествоТоваров, НомерСтрокиНачало,СуммаНДСВознаграждения);
            КонецЕсли;
            
            // Начинаем новый документ
            Если НЕ ПервыйДокумент Тогда
                ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
            КонецЕсли;
            
            ПервыйДокумент = Ложь;
            НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
            ТекущийДокумент = ВыборкаВсехСтрок.Ссылка;
            
            // Выводим шапку
            ВывестиШапкуДокумента(ТабличныйДокумент, Макет, ВыборкаВсехСтрок, ДополнительнаяКолонкаПечатныхФормДокументов);
            
            ТекущийИтого = 0;
            ТекущийИтогоВознаграждения = 0;  
            НомерПП = 1;
            КоличествоТоваров = 0;
			СуммаНДСВознаграждения = 0;
            
        КонецЕсли;
        
        // Выводим строку товара
        ВывестиСтрокуТовара(ТабличныйДокумент, Макет, ВыборкаВсехСтрок, НомерПП, ТекущийИтого, ТекущийИтогоВознаграждения, КоличествоТоваров,СуммаНДСВознаграждения);
        НомерПП = НомерПП + 1;
        
    КонецЦикла;
    
    // Завершаем последний документ
    Если ТекущийДокумент <> Неопределено Тогда
        ВывестиИтогиДокумента(ТабличныйДокумент, Макет, ТекущийДокумент, ТекущийИтого, ТекущийИтогоВознаграждения, КоличествоТоваров, НомерСтрокиНачало,СуммаНДСВознаграждения);
    КонецЕсли;
    
    Возврат ТабличныйДокумент;
    
КонецФункции

// Процедура вывода строки товара
Процедура ВывестиСтрокуТовара(ТабличныйДокумент, Макет, Выборка, НомерПП, ТекущийИтого, ТекущийИтогоВознаграждения, КоличествоТоваров,СуммаНДСВознаграждения)
    
    ОбластьСтроки = Макет.ПолучитьОбласть("Строка");
    ОбластьСтроки.Параметры.Заполнить(Выборка);
    ОбластьСтроки.Параметры.НомерСтроки = НомерПП;
	ОбластьСтроки.Параметры.СуммаНДСВознаграждения = Выборка.СуммаНДСВознаграждения;
	ОбластьСтроки.Параметры.ПеречисленоПринципалу = Выборка.Сумма-Выборка.СуммаВознаграждения;
    
	//СуммаПоСтроке = Выборка.Сумма + Выборка.СуммаНДС;
	//ОбластьСтроки.Параметры.Цена = ?(Выборка.Количество <> 0, СуммаПоСтроке/Выборка.Количество, 0);
	//ОбластьСтроки.Параметры.Сумма = СуммаПоСтроке;

	СуммаПоСтроке = Выборка.Сумма;
    
    ТабличныйДокумент.Вывести(ОбластьСтроки);
    
    ТекущийИтого = ТекущийИтого + СуммаПоСтроке;
    ТекущийИтогоВознаграждения = ТекущийИтогоВознаграждения + Выборка.СуммаВознаграждения;
	СуммаНДСВознаграждения = СуммаНДСВознаграждения + Выборка.СуммаНДСВознаграждения;
    КоличествоТоваров = КоличествоТоваров + 1;
    
КонецПроцедуры

// Вспомогательные процедуры
Процедура ВывестиШапкуДокумента(ТабличныйДокумент, Макет, Выборка, ДополнительнаяКолонкаПечатныхФормДокументов)
    
    // Заголовок
    ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
    ОбластьМакета.Параметры.ТекстЗаголовка = "об исполнении поручения по Агентскому договору №"+Выборка.ДоговорКонтрагента.Номер+" от "+Формат(Выборка.ДоговорКонтрагента.Дата,"ДФ=dd.MM.yyyy")+"г.";
	ОбластьМакета.Параметры.ДатаДокумента = Формат(Выборка.Ссылка.Дата,"ДФ=dd.MM.yyyy")+"г.";	
    ТабличныйДокумент.Вывести(ОбластьМакета);
    
    // Комитент
    СведенияОКонтрагенте = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Выборка.Контрагент, Выборка.Дата);
    ПредставлениеКонтрагента = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКонтрагенте, "НаименованиеДляПечатныхФорм,");
    
    ОбластьМакета = Макет.ПолучитьОбласть("Комитент");
    ОбластьМакета.Параметры.Заполнить(Выборка);
    ОбластьМакета.Параметры.ПредставлениеПоставщика = ПредставлениеКонтрагента;
    ОбластьМакета.Параметры.Поставщик = Выборка.Контрагент;
    ТабличныйДокумент.Вывести(ОбластьМакета);
    
    // Организация
    СведенияОбОрганизации = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Выборка.Организация, Выборка.Дата, , , , Истина);
    ПредставлениеОрганизации = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОбОрганизации, "НаименованиеДляПечатныхФорм,");
    
    ОбластьМакета = Макет.ПолучитьОбласть("Организация");
    ОбластьМакета.Параметры.Заполнить(Выборка);
    ОбластьМакета.Параметры.ПредставлениеПолучателя = ПредставлениеОрганизации;
    ОбластьМакета.Параметры.Получатель = Выборка.Организация;
    ТабличныйДокумент.Вывести(ОбластьМакета);
    
    // Шапка таблицы
    ОбластьШапки = "ШапкаТаблицы";
    ОбластьМакета = Макет.ПолучитьОбласть(ОбластьШапки);
    ТабличныйДокумент.Вывести(ОбластьМакета);
    
КонецПроцедуры


Процедура ВывестиИтогиДокумента(ТабличныйДокумент, Макет, ДокументСсылка, Итого, ИтогоВознаграждения, КоличествоТоваров, НомерСтрокиНачало,СуммаНДСВознаграждения)
    
    // Итого
    ОбластьМакета = Макет.ПолучитьОбласть("Итого");
    ОбластьМакета.Параметры.СуммаНДСВознаграждения = СуммаНДСВознаграждения;
    ОбластьМакета.Параметры.СуммаВознаграждения = ИтогоВознаграждения;        
	ОбластьМакета.Параметры.ПеречисленоПринципалу = Итого-ИтогоВознаграждения;
	ОбластьМакета.Параметры.Сумма = Итого;

    ТабличныйДокумент.Вывести(ОбластьМакета);
    
    // Сумма прописью
    ВыборкаДокумента = Новый Структура("Ссылка, ВалютаДокумента", ДокументСсылка, ДокументСсылка.ВалютаДокумента);
    
    ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописью");
    ОбластьМакета.Параметры.СуммаПрописью = ОбщегоНазначенияБПВызовСервера.СформироватьСуммуПрописью(Итого, ВыборкаДокумента.ВалютаДокумента);
    ОбластьМакета.Параметры.СуммаВознаграждения = НСтр("ru = 'Сумма комиссионного вознаграждения составила'") + " "
        + ОбщегоНазначенияБПВызовСервера.СформироватьСуммуПрописью(ИтогоВознаграждения, ВыборкаДокумента.ВалютаДокумента)+", в том числе НДС 5% в сумме: "+Формат(СуммаНДСВознаграждения,"ЧРГ=' '; ЧГ=3,0")+" руб.";
    
    ОбластьМакета.Параметры.ИтоговаяСтрока = НСтр("ru = 'Всего наименований %Количество%, на сумму'") + " "
        + ОбщегоНазначенияБПВызовСервера.ФорматСумм(Итого, ВыборкаДокумента.ВалютаДокумента);
    ОбластьМакета.Параметры.ИтоговаяСтрока = СтрЗаменить(ОбластьМакета.Параметры.ИтоговаяСтрока, "%Количество%", КоличествоТоваров);
    ТабличныйДокумент.Вывести(ОбластьМакета);
    
    // Подписи
    ОбластьМакета = Макет.ПолучитьОбласть("Подписи");     
    ОбластьМакета.Параметры.ПринципалНаименование = ДокументСсылка.Контрагент.НаименованиеПолное;
    ОбластьМакета.Параметры.АгентНаименование = ДокументСсылка.Организация.НаименованиеСокращенное;
	//ОтветственныеЛица(ВыборкаДокумента.Организация,ВыборкаДокумента.Дата);
	//ОбластьМакета.Параметры.КонтрагентПодпись = ОтветственныеЛицаБП.ОтветственныеЛица(ДокументСсылка.Организация,ВыборкаДокумента.Дата);
	Ответственный = ОтветственныеЛицаБП.ОтветственныеЛица(ДокументСсылка.Организация,ДокументСсылка.Дата);
	ОбластьМакета.Параметры.ОрганизацияПодпись = строка(Ответственный.ИсполнительДолжность) + "  " + строка(Ответственный.Исполнитель);
    ТабличныйДокумент.Вывести(ОбластьМакета);
	
    // Область печати
    //УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, Неопределено, ДокументСсылка);
    
КонецПроцедуры


&После("ДобавитьКомандыПечати")
Процедура ЭТ_ДобавитьКомандыПечати(КомандыПечати)
    // Добавляем новую команду ЭТ_ОтчетАгента
    КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.Идентификатор = "ЭТ_ОтчетАгента";
    КомандаПечати.Представление = НСтр("ru = 'Отчет агента ТО'");
    КомандаПечати.ЗаголовокФормы = НСтр("ru = 'Отчет агента ТО'");
    КомандаПечати.МенеджерПечати = "Документ.ОтчетКомитентуОПродажах";
    КомандаПечати.Порядок = 5; // Показывать первой
КонецПроцедуры       


&После("Печать")
Процедура ЭТ_Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)
    
    // Добавляем обработку новой команды ЭТ_ОтчетАгента
    Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЭТ_ОтчетАгента") Тогда
        
        ТабличныйДокумент = ПечатьОтчетАгента(МассивОбъектов, ОбъектыПечати);
        
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
            КоллекцияПечатныхФорм,
            "ЭТ_ОтчетАгента", 
            НСтр("ru = 'ЭТ Отчет агента'"),
            ТабличныйДокумент,
            ,
            "Документ.ОтчетКомитентуОПродажах.ЭТ_ОтчетАгента");            
    КонецЕсли;    
КонецПроцедуры
